In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [35]:
items = pd.read_csv('input/items.csv')
shops = pd.read_csv('input/shops.csv')
item_categories = pd.read_csv('input/item_categories.csv')

sample_submission = pd.read_csv('input/sample_submission.csv')
# set index to ID to avoid droping it later
test  = pd.read_csv('input/test.csv').set_index('ID')

In [36]:
sales_train1 = pd.read_csv('input/sales_train.csv', index_col=['date'] ,parse_dates=[0])
sales_train2 = pd.read_csv('input/sales_train.csv')

In [38]:
sales_train1 = sales_train1[(sales_train1.item_price > 0) & (sales_train1.item_price <= 25000)]

In [39]:
sales_train1.head()

            date_block_num  shop_id  item_id  item_price  item_cnt_day
date
2013-02-01               0       59    22154      999.00           1.0
2013-03-01               0       25     2552      899.00           1.0
2013-05-01               0       25     2552      899.00          -1.0
2013-06-01               0       25     2554     1709.05           1.0
2013-01-15               0       25     2555     1099.00           1.0

In [41]:
sales_train1.count()

date_block_num    2933475
shop_id           2933475
item_id           2933475
item_price        2933475
item_cnt_day      2933475
dtype: int64

In [44]:
sales_train2 = sales_train1.groupby(['date_block_num', 'shop_id', 'item_id']).sum()

In [48]:
sales_train2

                                item_price  item_cnt_day
date_block_num shop_id item_id
0              0       32            884.0           6.0
                       33           1041.0           3.0
                       35            247.0           1.0
                       43            221.0           1.0
                       51            257.0           2.0
...                                    ...           ...
33             59      22087         357.0           6.0
                       22088         238.0           2.0
                       22091         179.0           1.0
                       22100         629.0           1.0
                       22102        1250.0           1.0

[1608228 rows x 2 columns]

In [47]:
map(list)

array([(0, 0, 32), (0, 0, 33), (0, 0, 35), ..., (33, 59, 22091),
       (33, 59, 22100), (33, 59, 22102)], dtype=object)

In [28]:
grp = train.groupby(['date_block_num', 'shop_id', 'item_id']).agg({'item_cnt_day': ['sum']})

In [ ]:
gp = train.groupby(['date_block_num', 'shop_id', 'item_id']).agg({'item_cnt_day': ['sum']})

In [29]:
# sales_train3 = sales_train1.pivot_table(index = ['date','shop_id', 'item_id'], values = ['item_cnt_day'])

In [30]:
sales_train3

                                item_cnt_day
date_block_num shop_id item_id
0              0       32                1.5
                       33                1.0
                       35                1.0
                       43                1.0
                       51                1.0
...                                      ...
33             59      22087             2.0
                       22088             1.0
                       22091             1.0
                       22100             1.0
                       22102             1.0

[1609124 rows x 1 columns]

In [31]:
sales_train3.reset_index(inplace=True)

In [32]:
sales_train3.head(3)

   date_block_num  shop_id  item_id  item_cnt_day
0               0        0       32           1.5
1               0        0       33           1.0
2               0        0       35           1.0

In [33]:
sales_train4 =pd.merge(test, sales_train3, on=['item_id', 'shop_id'], how='left')

In [34]:
sales_train4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 702955 entries, 0 to 702954
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   shop_id         702955 non-null  int64
 1   item_id         702955 non-null  int64
 2   date_block_num  600159 non-null  float64
 3   item_cnt_day    600159 non-null  float64
dtypes: float64(2), int64(2)
memory usage: 26.8 MB

In [19]:
dataset = pd.merge(test, sales_train4, on=['item_id','shop_id'], how = 'left')

In [19]:
test.shape

(214200, 2)

In [23]:
dataset2 = dataset.groupby(by=['date']).sum()

In [24]:
dataset2

            shop_id   item_id  item_cnt_day
date
2013-01-01     5032   1877244         237.0
2013-01-02    14169   4388177         538.0
2013-01-03    21558   6076682         770.0
2013-01-04    13881   4236994         509.0
2013-01-05    25901   8371803        1020.0
...             ...       ...           ...
2015-12-06    60493  18759946        2119.0
2015-12-07    51767  16561045        1782.0
2015-12-08    43829  14516131        1521.0
2015-12-09    75598  22297655        2880.0
2015-12-10    35154  12293377        1303.0

[1034 rows x 3 columns]